[
    {
        "section": "Academic Brochure Introduction",
        "content": [
            "Academic",
            "Brochure",
            "July 2024"
        ]
    },
    {
        "section": "Brief History of Academics at IIT Jammu",
        "content": [
            "Brief History of Academics at",
            "IIT Jammu",
            "IIT Jammu started its journey in 2016 with three UG programmes",
            "with an intake of 82 students.",
            "As of June 2024, IIT Jammu has more than 1600 students",
            "studying in various UG, PG, and PhD programmes.",
            "At present, IIT Jammu offers admissions to seven BTech",
            "programmes, eight MTech programmes, two MSc and an MS(R)",
            "programmes, two Executive MTech programmes, one PG",
            "Diploma programme, and eleven PhD programmes."
        ]
    },
    {
        "section": "Contents",
        "content": [
            "CONTENTS",
            "1.0   Academic Disciplines",
            "2.0  Admission to Programmes",
            "3.0  Academic Calendar",
            "4.0  Channels of Communication",
            "5.0  Courses",
            "6.0  Evaluations",
            "7.0  Academic Discipline and Honour Code",
            "8.0  Fellowships and Financial Support",
            "9.0  Awards",
            "Annexure A",
            "5",
            "8",
            "13",
            "16",
            "19",
            "23",
            "27",
            "31",
            "36",
            "39"
        ]
    },
    {
        "section": "Glossary",
        "content": [
            "GLOSSARY",
            "BTech",
            "CGPA",
            "COAP",
            "CSIR",
            "DPGC",
            "DUGC",
            "FA",
            "GPEC",
            "JAB",
            "JAM",
            "JoSAA",
            "MCM",
            "MSc",
            "MTech",
            "PC",
            "PG",
            "Bachelor of Technology",
            "Cumulative Grade Point Average",
            "Common Offer Acceptance Portal",
            "Council of Scientific and Industrial Research",
            "Departmental Postgraduate Committee",
            "Departmental Undergraduate Committee",
            "Faculty Advisor",
            "Grade Point Earning Course",
            "Joint Admission Board",
            "Joint Admission test for Masters",
            "Joint Seat Allocation Authority",
            "Merit-cum-Means",
            "Master of Science",
            "Master of Technology",
            "Programme Coordinator",
            "Postgraduate",
            "PG Diploma",
            "Postgraduate Diploma",
            "PMRF",
            "QUEST",
            "RA",
            "SERB",
            "SGPA",
            "SPGB",
            "SRC",
            "SUGB",
            "TA",
            "UGC",
            "Prime Minister Research Fellowship",
            "Quality for Undergraduates in Engineering, Science, and Technology",
            "Research Assistant",
            "Science and Engineering Research Board",
            "Semester Grade Point Average"
        ]
    },
    {
        "section": "Academic Disciplines",
        "content": [
            "1.0",
            "Academic",
            "Disciplines"
        ]
    },
    {
        "section": "Undergraduate and Postgraduate Programmes",
        "content": [
            "Undergraduate Programmes (UG)",
            "The following major programmes are offered by IIT Jammu for undergraduate studies:",
            "BTech in Chemical Engineering",
            "BTech in Civil Engineering",
            "BTech in Computer Science and Engineering",
            "BTech in Electrical Engineering",
            "BTech in Materials Engineering",
            "BTech in Mathematics and Computing",
            "BTech in Mechanical Engineering",
            "Postgraduate Programmes (PG)",
            "The following programmes are offered by IIT Jammu for postgraduate studies:",
            "MTech in Computer Science Engineering",
            "MTech in Computer Science Engineering (3 years)",
            "MTech in Electrical Engineering",
            "- with a specialization in Communications and Signal Processing",
            "- with a specialization in VLSI Design",
            "MTech in Civil Engineering",
            "- with a specialization in Tunnel Engineering",
            "- with a specialization in Structural Engineering",
            "MTech in Mechanical Engineering",
            "- with a specialization in Thermal and Energy Systems Engineering",
            "MTech in Chemical Engineering",
            "- with a specialization in Sustainable Energy Engineering",
            "Executive MTech in Artificial Intelligence and Machine Learning",
            "MSc & MS(R) Chemistry",
            "MSc Physics",
            "PG Diploma in Cyber Security",
            "Doctor of Philosophy (PhD)",
            "PhD is offered by the following departments:",
            "Bio-Sciences and Bio-Engineering",
            "Chemical Engineering",
            "Chemistry",
            "Civil Engineering",
            "Computer Science and Engineering",
            "Electrical Engineering",
            "Humanities and Social Sciences",
            "Materials Engineering",
            "Mathematics",
            "Mechanical Engineering",
            "Physics",
            "6"
        ]
    },
    {
        "section": "Academic Administration",
        "content": [
            "Academic Administration",
            "Academic  Affairs  Section  works  under  the  supervision  of  Dean  Academic  Affairs  assisted  by",
            "Associate Deans and Assistant Registrar as detailed below:",
            "Dean Academic Affairs",
            "Associate Dean (Curriculum, UG, PG)",
            "Associate  Dean",
            "Interdisciplinary Programmes)",
            "(Research  Programme  &",
            "Deputy Registrar and Staff",
            "7"
        ]
    },
    {
        "section": "Admission to Programmes",
        "content": [
            "2.0",
            "Admission to",
            "Programmes"
        ]
    },
    {
        "section": "BTech Admission Procedure",
        "content": [
            "2.1  BTech Programmes and Admission Procedure",
            "institute  offers  admissions",
            "The",
            "into  seven  BTech  programmes.  Admission  to  BTech",
            "programmes is done through the Joint Seat Allocation Authority (JoSAA) and administered by",
            "the Joint Admission Board (JAB) at the all-India level. The BTech programme is a regular full-",
            "time residential programme which generally spans four academic years.",
            "After  receiving  the  report  of  admitted  students  from  JOSAA,  online  verification,  registration,",
            "and  fee  payment  along  with  physical  document  verification  are  done.  Once  the  process  is",
            "complete,  the  class  work  commences  per  the  semester  schedule  (available  on  institute",
            "website).  Students  have  to  register  in  each  semester.  The  semester  registration  process",
            "includes:",
            "are",
            "Course offering by the departments",
            "Students  have  to  pay  the  fees  within  the  stipulated  timeline  defined  in  the  semester",
            "schedule (available on institute website)",
            "Course",
            "windows",
            "There",
            "Approval/Add/Drop/Audit/Withdraw, which are defined in the Semester Schedule (available",
            "on  institute  website).  The  student  should  complete  the  semester  course  registration",
            "through these windows.",
            "Credit requirements for graduation are defined in Annexure A. The student should refer to",
            "this annexure while registering for courses in a semester.",
            "courses",
            "specific",
            "related",
            "i.e.",
            "to",
            "Change of specialization/internal sliding is not allowed after taking admission to IIT Jammu.",
            "2.2  Master of Technology (MTech)",
            "Two types of MTech programmes are offered by the institute: 1) a regular full-time two or three-",
            "year  MTech  programme  wherein  students  stay  on  the  campus  throughout  the  programme",
            "duration,  and  2)  an  online  Executive  MTech  programme  specifically  aimed  at  working",
            "professionals wherein students attend the classes online. In the former category, the option of",
            "self-sponsorship  is  available  in  all  specializations.  tudents  can  visit  the  institute 2019s  website  for",
            "the minimum educational qualifications and other eligibility requirements for admission to an",
            "MTech programme.",
            "Categories of Admission",
            "Candidates  are  admitted  into  the  regular  MTech  programme  of  the  institute  under  the",
            "following categories:",
            "Teaching Assistant (TA)",
            "Research Assistant (RA)",
            "The students joining an MTech programme under the TA category are considered for teaching",
            "assistantships based on the following norms:",
            "The  student  under  the  TA  category  assists/works  for  courses,  laboratory,  or  any  other",
            "related academic/administrative work to the extent of eight hours per week as assigned by",
            "the DPGC of the department concerned.",
            "The assistantship is available for a maximum period of 24 months.",
            "Assistantship  is  paid  based  on  monthly  attendance  and  satisfactory  performance  in  TA"
        ]
    },
    {
        "section": "MTech Admission Procedure",
        "content": [
            "Research Assistant (RA)",
            "The students joining an MTech programme under the RA category are considered for research",
            "assistantship based on the following norms:",
            "The  RAs  look  after  the  undergraduate  laboratories  and  assist  in  teaching  or  research  and",
            "other academic/administrative work to the extent of 20 hours per week as assigned by the",
            "DPGC of the department concerned.",
            "The expected time to complete the MTech degree for a student under the RA category is",
            "three  years,  and  the  assistantship  will  be  given  for  a  maximum  period  of  36  months  from",
            "joining.",
            "Admission Procedure",
            "The  departments  offering  the  MTech  programmes  adopt  minimum  eligibility  criteria  and",
            "advertise  the  same.  The  admission  process  may  run  through  the  Common  Offer  Acceptance",
            "Portal (COAP) or any similar procedure adopted by the institute.",
            "In case of admission through written test/interview, a minimum weightage of 70% is given to",
            "the GATE score in the final cumulative score for selection. In cases where a candidate opts for",
            "the self-sponsored MTech programme, GATE score is not required, and the selection is done by",
            "the individual departments, conducting written exams and/or interviews.",
            "The  reservation  of  seats  is  as  per  the  rules  notified  by  the  Government  of  India  from  time  to",
            "time.",
            "Candidates admitted to an MTech programme under the RA category (three-year programme)",
            "cannot change their category to the TA category (two-year programme).",
            "Change of specialization/internal sliding is not allowed after admission.",
            "Duration of MTech Programme",
            "The courses for the PG students to complete the MTech programme are offered in two regular",
            "semesters in a year: Autumn and Winter. The students pursuing the regular MTech degree are",
            "expected to complete all the degree requirements as per the following timeline:",
            "1.  PG  students  receiving  TA:  It  is  expected  that  a  PG  student  under  the  TA  category  will",
            "complete  all  degree  requirements  in  four  semesters.  An  extension  of  a  maximum  of  two",
            "additional  semesters,  i.e.,  a  total  of  six  semesters,  may  be  allowed  upon  approval  from  the",
            "Senate. For details, refer to the rules and regulations on the  institute website.",
            "2.  PG  students  receiving  RA:  It  is  expected  that  a  PG  student    under  the  RA  category  will",
            "complete  all  degree  requirements  in  six  semesters.  An  extension  of  a  maximum  of  two",
            "additional  semesters,  i.e.,  a  total  of  eight  semesters,  may  be  allowed  upon  approval  from  the",
            "Senate. For details, refer to the rules and regulations on the institute website.",
            ".",
            "3. Extension to the programme can be given in the following cases:",
            "Academic probation (Refer rule 1.5.6.1)",
            "Medical grounds",
            "Break for establishing a start-up or taking up a job",
            "10"
        ]
    },
    {
        "section": "MSc and MS(R) Admission",
        "content": [
            "2.3 Master of Science: MSc and MS(R)",
            "The MSc and MS(R) are postgraduate programmes in the science departments at IIT Jammu.",
            "Presently, they are offered by the Physics and Chemistry departments.",
            "Admission  to  these  programmes  is  through  the  Joint  Admission  test  for  Masters  (JAM).",
            "Minimum  educational  qualifications  for  admission  to  MSc  and  MS(R)  programmes  are",
            "available on the institute's website.",
            "MSc Programme",
            "MSc is a two-year programme in science.",
            "MS(R) Programme",
            "MS(R) is a three-year programme with a focus on research/dissertation in the last year.",
            "Admission Procedure",
            "The  department  offering  the  MSc/MS(R)  programme  adopts  minimum  eligibility  criteria  and",
            "advertises the same. The admission is through the JAM portal or any other similar procedure.",
            "The reservation of seats is per the rules notified by the Government of India from time to time.",
            "Change of specialization/internal sliding is not allowed after admission.",
            "2.4  Admission to PhD Programmes",
            "Candidates applying for the PhD programmes are selected based on a written test and/or an",
            "interview.",
            "Minimum  educational  qualifications  for  admission  to  PhD  programme  are  available  on  the",
            "institute website.",
            "The shortlisting of applications for the purpose of admission tests and interviews is done by",
            "the respective departments.",
            "The selection process will be defined by the DPGC of the department separately based on",
            "the requirement. The DPGC of the department may set the shortlisting criteria higher than",
            "the advertised minimum eligibility criteria, if considered necessary.",
            "Reservations and Quotas",
            "The reservation of seats shall be as per the rules notified by the Government of India from time",
            "to time.",
            "Classifications",
            "The  applicants  for  admission  to  the  PhD  programme  are  classified  under  any  one  of  the",
            "following categories:",
            "Institute Research Student/Candidate (full-time)",
            "Externally Funded Student (full-time), financed by CSIR, UGC, or other nationally funded",
            "Sponsored  Research  Student/Candidate  nominated  by  the  Government  of  India  under  a",
            "cultural  exchange  scholarship  programme,  a  self-financing  foreign  student,  or  a  scholar",
            "admitted under an MoU (full-time) Off-Campus Research Student (part-time) with external",
            "funding. Further details may be referred to on the institute website.",
            "11"
        ]
    },
    {
        "section": "Executive MTech and PG Diploma",
        "content": [
            "2.5 Executive MTech",
            "This  programme  is  meant  for  working  professionals,  and  the  admission  procedure  and",
            "criteria  are  different  from  the  regular  programmes,  with  appropriate  weightage  given  to",
            "work experience in the field.",
            "Interested  candidates  may  visit  the",
            "qualifications for admission to the Executive MTech programme.",
            "institute 2019s  website",
            "for  minimum  educational",
            "2.6 PG Diploma",
            "The Indian Institute of Technology Jammu offers a 12-month Postgraduate Diploma in Cyber",
            "Security for working professionals.",
            "12"
        ]
    },
    {
        "section": "Academic Calendar",
        "content": [
            "3.0",
            "Academic",
            "Calendar"
        ]
    },
    {
        "section": "Semester Schedule and Hostel",
        "content": [
            "3.1 Semesters",
            "IIT  Jammu  follows  a  semester  system  for  the  academic  calendar.  A  semester  typically",
            "corresponds  to  14  weeks  of  instruction  and  about  two  weeks  of  exams  and  assessments.  A",
            "typical academic year comprises two semesters, termed  Autumn/Monsoon Semester",
            "semester,  and  Winter/Spring Semester  or  even semester. ",
            "The  annual  summer  break/vacation  for  undergraduate  students  is  after  the Winter  Semester",
            "and  is  about  10-12  weeks  long.  Therefore,  an  academic  year  consists  of  two  semesters  and,",
            "optionally,  a  summer  term.  All  three  may  be  called  terms,  but  only  those  that  are  about  16",
            "weeks or more in total duration are called semesters.",
            "During the summer vacation, a  Summer Term  with 10 weeks of instruction and examinations,",
            "may be offered as a special term where courses are taught for special reasons, such as to help",
            "students  clear  their  backlog  courses.  The  Summer  Term,  being  a  special  term,  has  a",
            "compressed  schedule  such  that  any  course    taught  will  have  more  lectures/labs  per  week",
            "compared to that in a regular semester (more by a factor of about 1.5). The tentative times of",
            "the semesters and summer term are shown in the table under 3.2.",
            "3.2 Schedule and Hostel",
            "The academic year begins in late July or early August of every year. At the end of the academic",
            "year is the summer vacation, which is about 10-12 weeks long.",
            "During  the  summer  vacation,  regular  classes  are  not  held,  and  undergraduate  students  have",
            "to  vacate  the  hostels.  This  vacation  is  not  available  to  postgraduate  students,  including",
            "doctoral students, who work on research problems and are subject to separate leave rules. The",
            "leave rules for postgraduate and doctoral students are available on the institute's website (See",
            "Rule 10).",
            "Undergraduate  students  working  on  a  project  or  internship  during  vacation  period  may",
            "request permission to stay in the hostel.",
            "Additional  rules  and  fees  will  govern  their  stay  in  this  period.  This  also  applies  to  students",
            "enrolling in summer courses*.",
            "During  the  vacation  period,  the  hostels  may  be  used  to  accommodate  visiting  scholars  in",
            "continuing  education  programmes.  Therefore,  undergraduate  students  requiring  hostel",
            "accommodation during vacations must plan adequately in advance.",
            "Name",
            "Duration",
            "Time of the Year",
            "Autumn/Monsoon Semester, Odd",
            "Semester",
            "Winter Semester, Even Semester",
            "Summer Term*",
            "16 weeks",
            "August to early December",
            "10 weeks",
            "January to early May",
            "Mid-May to July",
            "*  Summer  courses  are  subject  to  several  conditions,  and  are  not  routine  as  in  the  case  of  the",
            "semesters.",
            "14"
        ]
    },
    {
        "section": "Timetable and Fees",
        "content": [
            "3.3 Timetable",
            "The timetable for each semester is uploaded on the institute website one week prior to the",
            "start date of the semester.",
            "3.4 Fees",
            "All  students  shall  pay  the  requisite  fee  in  order  to  enrol  in  courses  and  avail  on-campus",
            "facilities.",
            "The  payment  is  linked  to  the  course  registration  for  each  semester  of  the  academic  year  i.e.,",
            "students  are  required  to  pay  the  fee  to  register  for  the  courses.  For  fee  details,  students  can",
            "visit https://iitjammu.ac.in/fee",
            "A student may deposit the fee by logging into their SARAL account or deposit it in the institute",
            "bank account through NEFT/RTGS/Cheque/DD.",
            "The  students  paying  fees  through  NEFT/RTGS/Cheque/DD  should  submit  the  receipt  to  the",
            "institute through SARAL by raising a request on the Student Request Portal under the request",
            "type Updation of Payment Status and attaching the receipt.",
            "15"
        ]
    },
    {
        "section": "Channels of Communication",
        "content": [
            "4.0",
            "Channels of",
            "Communication"
        ]
    },
    {
        "section": "Undergraduate Communication Structure",
        "content": [
            "4.1 Undergraduate (BTech)",
            "Departmental UG Committees",
            "All  departments  offering  undergraduate  degrees  have  a  Departmental  Undergraduate",
            "Committee  (DUGC).  The  DUGC  is  responsible  for  administering  the  rules  pertaining  to",
            "undergraduate  courses  and  undergraduate  students  and  for  reporting  matters  to  and  from",
            "the Senate.",
            "Senate Undergraduate Board (SUGB)",
            "The SUGB is responsible for processing matters to be discussed in the Senate and overseeing",
            "the execution of Senate directives related to all UG academic matters of the institute.",
            "SUGB Members",
            "Members of the SUGB:",
            "Chairperson  of  the  SUGB:  The  chairperson  of  the  SUGB  is  the  Dean  (academics).  The",
            "Director may nominate someone other than the Dean (Academics) to chair the SUGB.",
            "Dean and Associate Deans (academics) as ex-officio members.",
            "Chairpersons of all DUGCs.",
            "Institute faculty members nominated by the Director of the institute.",
            "Two  student  representatives:  One  from  the  first/second  year  batch  and  the  other",
            "representative from the third/fourth year batch should be nominated by the Senate of the",
            "students.",
            "Faculty Advisor",
            "There  will  be  one  Faculty  Advisor  (FA)  for  every  UG  programme  of  the  department  to  advise",
            "the students regarding academics and choices leading to course registration.",
            "New Undergraduate Courses",
            "In case new course proposals or curricular modifications are orwarded by the DUGC, the SUGB",
            "will examine them and forward them to the Senate with suitable recommendations.",
            "Undergraduate Student Requests and Appeals",
            "Students can approach and/or appeal to the SUGB through the FA and DUGC.",
            "Escalation of Undergraduate Student Issues",
            "In case the SUGB cannot resolve the academic issue or there is no clarity on the issue, the case",
            "may be forwarded to the Senate.",
            "4.2 Postgraduate (MSc, MS(R), MTech, PhD)",
            "Department PG Committee (DPGC)",
            "All  departments  offering  postgraduate  degrees  (MSc,  MS(R),  M.Tech,  PhD)  will  have  a",
            "Departmental  Postgraduate  Committee  (DPGC).  The  DPGC  is  responsible  for  administering",
            "the rules pertaining to postgraduate courses and postgraduate students, and for reporting",
            "matters to and from the Senate.",
            "17"
        ]
    },
    {
        "section": "Postgraduate Communication Structure",
        "content": [
            "Senate Postgraduate Board (SPGB)",
            "The SPGB is responsible for processing matters to be discussed in the Senate and overseeing",
            "the execution of Senate directives related to all PG academic matters of the institute.",
            "SPGB Constitution",
            "Members of the SPGB:",
            "Chairperson  of  the  SPGB:  The  chairperson  of  the  SPGB  is  the  Dean  (Academics).  The",
            "Director may nominate someone other than the Dean (Academics) to chair the SPGB.",
            "Dean and Associate Deans (Academics) as ex-officio members",
            "Chairpersons of all DPGCs.",
            "Institute faculty members, as nominated by the Director.",
            "Three Student Representatives: One from the first-year MTech batch, one from the second-",
            "year  MTech  batch,  and  one  from  the  PhD  students,  as  nominated  by  the  Senate  of  the",
            "students.",
            "Programme Coordinator",
            "There will be one Programme Coordinator (PC) for every PG programme of the department, to",
            "advise the PG students on that programme.",
            "New Postgraduate Courses",
            "In  case  new  course  proposals  or  curricular  modifications  are  forwarded  by  the  DPGC,  the",
            "SPGB will discuss them and forward them to the Senate with suitable recommendations.",
            "Postgraduate Student Requests and Appeals",
            "Students  can  approach  and/or  appeal  to  the  SPGB  through  PC  and  DPGC.  The  SPGB  will",
            "resolve  the  issue/s  and  take  decision/s  accordingly.  The  decision  needs  to  be  communicated",
            "to the student or the person/s concerned and also to the DPGC.",
            "Escalation of Postgraduate Student Requests",
            "In case the SPGB cannot resolve the academic issue or there is no clarity on the issue, the case",
            "may be forwarded to the Senate.",
            "Postgraduate Semester Drop",
            "There is a provision that a postgraduate student may drop an entire semester, subject to the",
            "prior  approval  from  the  SPGB.  Semester  drop  may  be  allowed  in  case  of  medical  issues  or  in",
            "case the student requires a break for establishing a start-up or taking up a job.",
            "4.3 PhD Students",
            "Every PhD student in the institute will have a main supervisor from the institute. PhD students",
            "will also approach DPGC for any issues and will follow the same procedure as PG students,",
            "except that PC will be replaced by their Supervisor.",
            "18"
        ]
    },
    {
        "section": "Courses Overview",
        "content": [
            "5.0",
            "Courses"
        ]
    },
    {
        "section": "UG 2022 Curriculum",
        "content": [
            "5.1 UG 2022 Curriculum Courses and Categories",
            "An overview of the BTech curriculum is shown in the table below. The table is a quick reference",
            "for the basic BTech degree. Departments float the core courses in the specified semesters, and",
            "the students shall complete them only in the given slots.",
            "Total 138-144",
            "curricular credits",
            "+8 co-curricular",
            "credits",
            "Course Category",
            "Semester <18.5 curricular",
            "credits)",
            "Semester <18.5 curricular credits)",
            "HSS Core 6 credits",
            "HSS-I",
            "Science Core 18.5 cr",
            "edits)",
            "Maths-1",
            "Maths-2",
            "Physics (CE+CH+ME)",
            "Chemistry (CS+M&C+EE+MT)",
            "Chemistry (CE+CH +ME)",
            "Physics (CS+M&C+EE+MT)",
            "Institute Core 54",
            "-63 credits)",
            "Comp Syst Prog",
            "(CE+CS+M&C+EE+ME+MT)",
            "Data Structures(CE+CS+M&C+EE+M",
            "E+MT)",
            "Engineering Core(18",
            "-27 credits)",
            "Basic Electrical(CS+M&C+EE)",
            "Electronic Systems(CS+M&C+EE)",
            "Engg Mechanics(CE+MT+CH",
            "+ME)",
            "Solid Mechanics (CE+MT+CH+ME)",
            "Engg Materials (CH)",
            "Thermodynamics",
            "(MT+CH+ME+M&C)",
            "CAD(CS+M&C+EE+MT)",
            "Workshop (CS+M&C+EE+MT)",
            "Workshop (CE+CH+ME)",
            "CAD 00a0(CE+CH+ME)",
            "Design Core (1.5cr",
            "credits each)",
            "(Total 7.5-10.5credits)",
            "Departmental Core",
            "(21-45 credits)",
            "Dept Elective (12-",
            "36credits)",
            "Departmental"
        ]
    },
    {
        "section": "Advanced Curriculum and Flexibility",
        "content": [
            "Semester III",
            "(<18.5 curricular credits)",
            "Semester IV (18.5",
            "curricular credits)",
            "Semester V",
            "(<18",
            "curricular",
            "credits)",
            "Semester VI",
            "Semester",
            "VII (<18",
            "VIII (<18",
            "HSS-II (CH+ME+MT)",
            "HSS-II (CS+M&C+CE+EE)",
            "Biology (EE+CE+CS+M&C)",
            "Biology (CH+ME+MT)",
            "Comp Syst & Prog (CH)",
            "Data Structures (CH)",
            "Basic Electrical (CE+MT+CH+ME)",
            "Engg Mechanics (EE+CS)",
            "Solid Mechanics",
            "(CS+EE+M&C)",
            "Engg Materials (MT+ME)",
            "Fluid Dynamics (ME+CE+M&C)",
            "Numerical Methods",
            "(CE+CH+CS+M&C+ME+MT)",
            "Engg Standards",
            "(MT+ME)",
            "Elect Design (ALL)",
            "Mini Project (ALL)"
        ]
    },
    {
        "section": "Credit Registration Guidelines",
        "content": [
            "IIT  Jammu  allows  flexibility  to  enable  high-performing  students  to  take  minor  subjects,",
            "specialize  in  their  major,  take  electives  in  summer,  take  more  courses  each  semester,  and  so",
            "on,  and  allow  fewer  credits  to  safeguard  an  academically  non-performing  student  from",
            "impending termination. The table below presents guidance for credit load in such exceptions.",
            "Revised Credit Limits for Course Registration",
            "CGPA",
            "Backlogs at the time of registration (BL*)",
            "Credits of",
            "GPEC/Curricular courses",
            "to be allowed based on",
            "CR^",
            " ",
            ">6 but less than 7",
            " ",
            "Any CGPA",
            "BL=0 and did not have backlog anytime in",
            "previous semesters",
            "Had backlog previously but cleared",
            "BL  ",
            "BL > 2",
            "BL=0, either cleared now or did not have",
            "backlog anytime",
            "BL ",
            "1 BL ",
            "3<BL ",
            "5<BL",
            "BL ",
            "CR+6",
            "CR+3",
            "CR",
            "15",
            "12",
            "9",
            "*BL = Backlog courses in GPEC/Curricular courses only",
            "^CR = Number of credits entered by academic section in EG as per approved curriculum of each",
            "department/programme",
            "Most  courses  that  a  student  is  supposed  to  enrol  in  fall  into  either  of  the  two  categories:",
            "Institute Core Courses and Departmental Courses. There are eight types of curricular courses,",
            "as shown in the adjacent table. The four Institute Core Courses are normally completed in the",
            "first four semesters of the BTech programme.",
            "Additionally,  Co-Curricular  Courses  are  conducted  within  timetable  hours  and  these  progress",
            "from general to more detailed courses towards the final year of the degree.",
            "Curricular Courses",
            "Co-curricular Activities",
            "a. Institute Core Courses",
            "Humanities and Social Sciences Core",
            "Science Core",
            "Engineering Core",
            "Design Core",
            "b. Departmental Courses"
        ]
    },
    {
        "section": "Evaluations",
        "content": [
            "6.0",
            "Evaluations"
        ]
    },
    {
        "section": "UG Evaluation Methods",
        "content": [
            "6.1 UG 2022-Curriculum Students",
            "Instructors evaluate students using a combination of class tests, assignments, practicals, mid-",
            "semester and end-semester exams, term papers, etc. In general, class tests, assignments, and",
            "practicals are distributed throughout the semester and may contribute up to 50% towards the",
            "final course grade.",
            "The  final  exam  usually  contributes  40-60%  towards  the  final  course  grade.  The  exact",
            "distribution  of  marks  for  tests,  assignments,  practicals,  etc.,  is  decided  by  the  Course",
            "Coordinator/Instructor  and  is  announced  at  the  beginning  of  the  course  instruction.  Writing",
            "the end-semester exam is mandatory to pass a course.",
            "Each  unit  of  assessment  (i.e.,  class  test,  practical,  etc.)  is  marked  as  a  percentage  (or  any",
            "number that can essentially be scaled to a percentage). At the end of the semester, the Course",
            "Coordinator/Instructor calculates the overall marks obtained by each student and statistically",
            "assesses a student 2019s absolute knowledge and relative standing in a group of similar students.",
            "Based on this assessment, a letter grade is allotted to the student.",
            "Evaluation of Learning in Courses",
            "The  following  are  examples  of  typical  evaluation  methods  for  the  assessment  of  students.",
            "These are broad guidelines. The exact evaluation scheme used for any course is announced by",
            "the course coordinator at the beginning of the term.",
            "a. Theory Courses: Template Evaluation Scheme for Lecture-only",
            "Course",
            "Evaluation",
            "Category",
            "Compulsory",
            "Variable or",
            "Optional",
            "Evaluation Method",
            "Duration",
            "Component Weightage",
            "%",
            "Weightage",
            "Mid-semester Exam",
            "End-semester Exam",
            "Assignments",
            "Quizzes",
            "Term paper/ project",
            "Attendance",
            "1-2 hours",
            "2-3 hours",
            "-",
            "30 min",
            "10-20%",
            "40-60%",
            "0-25%",
            "0-20%",
            "0-5%",
            "50-80%",
            "20-50%",
            "b. Mixed Theory+Lab Courses: Template Evaluation Scheme for",
            "Lecture-plus-Practicals Course",
            "Total"
        ]
    },
    {
        "section": "Grading and Analysis",
        "content": [
            "c. Laboratory Practicals Courses: Template Evaluation Scheme for Practicals-only Course",
            "Evaluation",
            "Category",
            "Compulsory",
            "Variable or",
            "Option",
            "Evaluation Method",
            "Duration",
            "Component Weightage",
            "%",
            "Total Weightage",
            "Laboratory Practicals",
            "(2 hours) X (7-14",
            "times a semester)",
            "60-70%",
            "End-semester exam",
            "2 hours",
            "20-30%",
            "70-100%",
            "Term paper / project",
            "-",
            "0-20%",
            "0-30%",
            "6.2 Grade and Grade Analysis",
            "Grading Pattern and Analysis",
            "IIT  Jammu  follows  a  mixed  relative  grading  system  where  in  a  student 2019s  grade  in  a  course",
            "represents the student 2019s standing among other students who have taken the course, as well",
            "as  the  student 2019s  absolute  knowledge  to  some  extent.  The  grades  have  associated  numerical",
            "grade points in order to calculate averages and other statistics: see the table below.",
            "Grade AA AB BB BC CC CD DD FF",
            "SA UA",
            "II WW SS UU",
            "Points",
            "10",
            "9",
            "8",
            "7",
            "6",
            "5",
            "4",
            "0",
            "An  2018II 2019 grade is awarded in case of absence on medical grounds or other special circumstances,",
            "before  or  during  the  end  semester  examination  period,  provided  the  student  has  met  the",
            "attendance criterion of the course.",
            "A   2018WW 2019  grade  is  awarded  in  a  course  from  which  the  student  has  opted  to  withdraw.  The",
            "student  can  submit  the  withdrawal  request  within  the  specified  window  in  the  semester",
            "schedule.",
            "The   2018SS 2019  and   2018UU 2019  grades  denote  satisfactory  performance  and  non-satisfactory  performance,",
            "respectively, in co-curricular activities.",
            "Students who successfully complete auditing a grade will receive the Satisfactory Audit Grade:"
        ]
    },
    {
        "section": "PhD Curriculum and Evaluation",
        "content": [
            "Only one attempt is allowed for grade improvement in a particular course.",
            "Repetition of a course is allowed, provided the second attempt does not require overstay",
            "in IIT beyond the eighth semester.",
            "A course cannot be substituted for the improvement of a grade.",
            "The average of the grade obtained in a semester is called SGPA, and the average over all the",
            "previous  semesters,  including  the  present  semester,  is  called  CGPA.  More  details  can  be",
            "found in at rule 1.1.8",
            "PhD Curriculum Grading Pattern and Analysis",
            "A  student  having  earned  a  BTech  or  an  equivalent  degree  shall  be  required  to  complete  a",
            "minimum of 24 Grade Point Earning Credits (GPEC), while an MTech/MSc(& MA) or equivalent",
            "degree holder shall be required to complete a minimum of 12 GPEC course work. If a student",
            "with  an  MSc  degree  wants  to  register  for  a  PhD  (or  vice-versa)  in  an  engineering  discipline,",
            "they  must  complete  15  GPEC.  These  courses  may  be  prescribed  from  the  existing  MTech",
            "and/or pre-PhD courses at the institute. In addition, a candidate shall be required to take two",
            "credit-earning courses, resulting in a total of four credits.",
            "All new PhD students need to register for a minimum of two curricular/GPEC courses in the",
            "first  semester.  A  maximum  of  one  fail  grade  is  permitted  in  curricular/GPEC  courses,",
            "irrespective of the number of courses registered in the first semester.",
            "This  will  not  cause  discontinuation  in  the  programme  or  scholarship.  The  minimum  CGPA",
            "requirement shall be 7.0 on a 10-point scale for admission to the candidacy for a PhD degree. If",
            "the  CGPA  of  a  student  is  below  7.0  after  the  second  semester,  their  registration  will  be",
            "terminated. However, they can appeal to SPGB if the CGPA is lower than 7.00 at the end of the",
            "second semester and onwards. The academic/research progress of each student/candidate will",
            "be  monitored  by  DPGC/SRC  from  the  first  semester  of  joining  the  PhD  programme.  An  SRC",
            "form should be submitted within 60 days of the date of registration.",
            "For this purpose, each candidate has to submit a progress report at the end of each semester",
            "to  their  supervisor(s)  starting  from  the  end  of  the  first  semester.  On  receipt  of  the  progress",
            "report,  the  supervisor(s)  shall  arrange  an  evaluation  (which  includes  a  presentation  of  the",
            "progress  of  their  PhD  work)  with  the  SRC.  In  the  last  semester  of  his/her  work,  the  Synopsis",
            "(Ph.D.  thesis  draft)  presentation  may  be  considered  as  his/her  final  evaluation  and  no  more",
            "separate evaluation is required.",
            "Overall  2018SS 2019 grade will be awarded during that semester if the progress is  2018satisfactory 2019.",
            "If  the  progress  is   2018unsatisfactory 2019,  overall   2018UU 2019  grade  is  to  be  awarded.  If  there  are  two",
            "consecutive   2018UU 2019s  in  two  semesters,  the  registration  will  stand  terminated  automatically.  For",
            "details please check the Rules and Regulations as updated on the website (Link).",
            "26"
        ]
    },
    {
        "section": "Academic Discipline and Honour Code",
        "content": [
            "7.0",
            "Academic",
            "Discipline and",
            "Honour Code"
        ]
    },
    {
        "section": "Attendance Policies",
        "content": [
            "7.1 Attendance",
            "UG Students",
            "Students must attend all classes, and a minimum of 70% attendance is required for a  student",
            "to  be  allowed  to  write  the  final  exam.  The  relaxation  of  30%  is  given  so  that  a  student  can",
            "participate  in  extra-curricular  activities,  such  as  hackathons  and  inter-IIT  competitions  and",
            "allow  for  medical  exigencies.  Additional  relaxation  may  be  given  in  cases  of  severe  health",
            "issues,  which  shall  be  duly  certified  by  the  institute  doctor.  In  addition  to  this  minimum",
            "attendance,  course  coordinators  may  assign  an  additional  5%  of  the  grade  to  be  earned  by",
            "attendance. The same is declared at the beginning of the course instruction.",
            "PG Students",
            "Students must attend all classes, and a minimum of 75% attendance is required for a student",
            "to be allowed to write the final exam.",
            "PhD Students",
            "A  PhD  student,  irrespective  of  the  source  of  research  assistantship  (including  self-financing",
            "student  and  sponsored  student),  while  pursuing  coursework,  must  attend  at  least  80%  of",
            "classes in each course in which they are registered. In case their attendance falls below 80% in",
            "any course, they will be awarded a fail grade in that course.",
            "For  the  above  purpose,  if  the  percentage  works  out  to  be  a  number  which  is  not  a  whole",
            "number, the rounded-off integer will be used for assessment.",
            "7.2 Leaves and Leave Application Process",
            "1. In addition to public holidays, MTech students are entitled to 15 days of leave per semester.",
            "2. Carrying forward of balance leave is not possible from the first/second year to the second/",
            "third year.",
            "3. The MTech students can also avail special casual leave for five working days per semester to",
            "attend or present a research paper/poster in seminars/workshops/conferences/symposia to be",
            "held in India/abroad, subject to a favourable recommendation from one of the supervisors and",
            "approval from the head of the department.",
            "4. Leave for other academic purposes beyond the above-mentioned categories might also be",
            "sanctioned by the Dean (Academics), subject to a favourable recommendation from one of",
            "the supervisors and the Chairperson, DPGC.",
            "1. A full-time PhD student, during their stay at the institute, will be entitled to leave for 30 days",
            "on  a  pro-rata  basis  (2.5  days  per  month)  and  an  additional  10  days  on  medical  grounds  per",
            "academic year.",
            "2. They will not be entitled to mid-semester breaks and summer and winter vacations.",
            "3.  Leave  beyond  30  days  in  an  academic  year  may  be  granted  to  a  research  scholar  in",
            "exceptional  cases,  by  the  head  of  the  department  concerned,  subject  to  the  following",
            "conditions:",
            "The leave beyond 30 days will be without assistantship/scholarship",
            "Extension of up to an additional 30 days will be granted only once during the programme",
            "duration",
            "28"
        ]
    },
    {
        "section": "Leave Policies",
        "content": [
            "The  leave  will  be  subject  to  the  approval  of  the  head  of  department/programme",
            "coordinator  concerned  on  the  recommendation  of  the  supervisor,  and  a  proper  leave",
            "account of each scholar has to be maintained SARAL",
            "4. A female research scholar will be eligible for Maternity Leave with Assistantship for a period",
            "not  exceeding  180  days  once  during  the  PhD  programme.  This  period  shall  be  within  the",
            "maximum limit of five years. If maternity leave is availed during the time of coursework, then",
            "the  scholar  must  register  for  the  incomplete  courses  to  complete  coursework  requirements",
            "once she resumes the PhD programme.",
            "5.  A  male  research  scholar  will  be  eligible  for  Paternity  Leave  with  Assistantship  for  a  period",
            "not exceeding 15 days once during the tenure of the award.",
            "6. Female PhD scholars may be given an extension with a scholarship for the 6th year in some",
            "special cases. Information about such cases is available on the Institute website",
            "7.3 Ethics and Disciplinary Actions",
            "Academic Integrity and Discipline",
            "All  students  at  IIT  Jammu  undertake  to  observe  an  honour  code  by  which  they  promise  to",
            "maintain  the  utmost  integrity  and  honesty  in  all  their  endeavours  on  campus,  especially  in",
            "academic  courses.  Students  promise  to  abide  by  rules  that  forbid  any  form  of  cheating  or",
            "dishonest method to earn marks, grades and credits.",
            "A  student  who  breaks  the  honour  code  and  brings  discredit  to  the  quality  of  learning  at  IIT",
            "Jammu  is  subjected  to  disciplinary  action  that  can  include  dismissal  and  expulsion  from  the",
            "institute.",
            "Cheating in Assignments and Laboratory Practicals",
            "The use of any unfair means in assignments, lab reports, term papers, etc., is a serious offence.",
            "All  methods  of  cheating  including,  but  not  limited  to,  copying  from  others,  copying  from",
            "books, copying from the internet, helping others to cheat, and impersonating for the purpose",
            "of  cheating,  are  taken  very  seriously  as  academic  malpractices  and  can  result  in  severe",
            "punishments.",
            "Cheating in Exams",
            "Cheating  in  exams  by  copying,  helping  others  to  copy,  and  using  mobile  phones  and  other",
            "communication  devices  for  exchanging  information  leads  to  punishments.  If  invigilators  or",
            "examiners  find  evidence  of  cheating,  they  immediately  note  the  evidence  and  interrupt  the",
            "examination  for  the  student  involved,  and  the  student  is  not  allowed  to  continue  the",
            "examination.",
            "Plagiarism",
            "Plagiarism  is  the  attempt  to  pass  off  the  work  of  other  people  as  one 2019s  own.  Plagiarism",
            "includes,  but  is  not  limited  to,  copying  any  string  of  text  without  proper  attribution  and",
            "referencing, copying figures and tables without attribution and without legal permission. It is",
            "also  the  use  of  ideas  and  material  of  current  research  without  adequate  referencing  and",
            "attribution to the original authors.",
            "29"
        ]
    },
    {
        "section": "Ethics and Disciplinary Actions",
        "content": [
            "Plagiarism can also involve violation of copyright even for one 2019s own work if the copyright has",
            "been given to a publisher. This is termed self-plagiarism. For thesis and long documents that",
            "are archived, a plagiarism check is required.",
            "Disciplinary Action",
            "Cases  of  academic  cheating  and  plagiarism,  when  caught  by  an  invigilator,  examiner,  or",
            "instructor,  can  be  punished  by  interrupting  the  examination  or  assignment  in  progress.  The",
            "case  must  be  reported  through  the  department 2019s  DUGC  (for  undergraduates)  or  DPGC  (for",
            "postgraduates)  to  the  Institute  Disciplinary  Committee,  which  will  conduct  an  inquiry  and",
            "investigation and recommend additional punishment, if appropriate.",
            "The  punishment  for  cheating  can  range  from  failure  in  the  course  through  a  semester 2019s",
            "suspension and up to and including expulsion from the institute.",
            "Escalation",
            "In case SPGB cannot resolve an academic issue, the case might be forwarded to the Senate.",
            "30"
        ]
    },
    {
        "section": "Fellowships and Financial Support",
        "content": [
            "8.0",
            "Fellowships and",
            "Financial",
            "Support"
        ]
    },
    {
        "section": "Fellowship Details",
        "content": [
            "8.1 Fellowship",
            "Institute 2019s Fellowship for Graduated UG/PG Students",
            "This three-month fellowship is for UG/PG students who have graduated from IIT Jammu and",
            "intend to continue the work with a faculty. Such fellows will be associated with the concerned",
            "faculty  and  it  is  the  responsibility  of  this  supervisor  to  monitor  the  work  progress.  They  are",
            "expected  to  work  on  the  specific  plan  proposed  and  shall  submit  a  summary  of  the  works",
            "completed near the end of three months before applying for no dues/experience certificate.",
            "PhD Students",
            "Institute Early Post-Doctoral Fellowship",
            "This  three-month  fellowship  is  for  the  full-time  PhD  students  of  IIT  Jammu  who  have",
            "completed  their  Oral  Defense.  The  aim  is  to  provide  support  during  the  initial  career  days  of",
            "the  graduated  student  to  complete  pending  manuscripts  or  apply  for  other  funding",
            "opportunities.  The  early  post-doctoral  fellows  are  expected  to  work  on  the  specific  plan",
            "proposed  in  the  application  form  and  shall  submit  a  summary  of  the  works  completed  near",
            "the end of three months before applying for no dues/experience certificate. More information",
            "is available at the institute website.",
            "Financial Support for International Internships",
            "Partial financial support to research scholars seeking internships in internationally acclaimed",
            "academic/research  institutes  is  provided  to  PhD  students  of  IIT  Jammu.  The  internship  will",
            "also help students garner better research experience from leading experts in their respective",
            "fields,  possibly  leading  to  international  collaborations  for  IIT  Jammu.  Students  offered  an",
            "international research internship are eligible for financial support.",
            "Financial support for such internships can be availed by students once during their entire PhD",
            "programme.  A  maximum  of  10  students  will  be  given  financial  support  in  an  academic",
            "calendar, five per semester. More information is available at the institute website",
            "8.2 Scholarships",
            "Undergraduate Students (UG)",
            "The following scholarships are available to UG students:",
            "Merit-cum-Means (MCM)",
            "This scholarship is offered to a maximum of  25% of students 2019 total strength in the particular",
            "year  (branch-wise)  to  students  belonging  to  the  Gen/  OBC-NCL/  EWS  category.  The  benefits",
            "under this category include a tuition fee refund and an award of Rs 1,000/- per month.",
            "Eligibility Criteria:",
            "1.  The  MCM  scholarship  shall  be  available  to  General,  OBC-NCL  and  EWS  Category  students",
            "only.",
            "2.  For  the  new  admissions  every  year  (Autumn  Semester),  the  JEE  Advance  Rank  of  the  the",
            "student shall be considered for determining the merit and award of scholarship.",
            "3. For the existing students (Spring Semester and Autumn Semester  2013 except new admission),",
            "the  Cumulative  Performance  Index,  CPI  (SGPA  &  CGPA  each  >=6.0  and  with  total  backlog",
            "courses  <=2)  shall  be  considered  as  eligibility  criteria  to  apply  for  the  award  of  scholarship.",
            "Every semester the merit list will be prepared as per CGPA and eligibility criteria.",
            "32"
        ]
    },
    {
        "section": "Scholarships for UG Students",
        "content": [
            "4.  The  Gross  Annual  Income  of  parents/family  for  the  completed  financial  year  should  not  be",
            "more than Rs. 4.50 Lakh.",
            "5. The student who avails this scholarship shall not be eligible for accepting or applying for any",
            "other scholarship from Govt, Semi-Govt, Institutional, Private or any other sources.",
            "6. The student availing institute scholarship for a semester cannot opt for withdrawal/drop for",
            "the  same  semester.  If  they  do  so,  then  they  have  to  refund  the  availed  scholarship  for  that",
            "semester.",
            "Free Messing",
            "For  all  eligible  students  of  SC/ST/PWD  category  students.  The  facility  of  free  messing  (only",
            "basic  menu)  and  a  pocket  allowance  of  Rs  250/-  for  each  month  (only  those  months  will  be",
            "counted in which classes are being conducted) is also released upfront for each semester.",
            "Eligibility Criteria:",
            "The Free Messing scholarship shall be available to SC and ST category students only.",
            "The Gross Annual Income of parents/family for the completed financial year should not be",
            "more than Rs 4.50 lakh.",
            "For renewal, the minimum SGPA & CGPA each >= 6.0 and backlog of courses is <=2.",
            "The  student  who  avails  this  scholarship  shall  not  be  eligible  for  accepting  or  applying  for",
            "any other scholarship from Govt., Semi-Govt., Institutional, Private or other sources.",
            "Freeship",
            "Remission of tuition fee is for up to 10% of remaining Gen/ OBC-NCL/ EWS students (branch-",
            "wise) in a particular batch.",
            "The  Remission  of  Fee  scholarship  is  available  to  General,  OBC-NCL  and  EWS  Category",
            "students only. It will be awarded to a maximum of 10% of remaining (who are not covered",
            "under MCM) General, OBC and EWS students in each branch for a particular year in each",
            "Those  students  whose  Gross  Annual  Income  of  parents/family  for  the  previous  financial",
            "year is in between Rs. 1.00 Lakh to Rs. 4.5 Lakh are eligible for remission of tuition fee.",
            "For new admissions every year (Autumn Semester), the JEE Advanced rank of the student",
            "is considered for determining the merit and award of scholarship.",
            "For  existing  students  (Spring  Semester  and  Autumn  Semester   2013  except  new  admission),",
            "the Cumulative Performance Index, CPI (SGPA & CGPA each >=6.0 and with total backlog",
            "courses  <=2)  is  considered  as  the  eligibility  criteria  to  apply  for  the  award  of  scholarship.",
            "Every semester the merit list is prepared as per CGPA and eligibility criteria.",
            "The  student  who  avails  this  scholarship  is  not  eligible  for  accepting  or  applying  for  any",
            "other scholarship from Govt., Semi-Govt., Institutional, Private or any other sources.",
            "QUEST",
            "Quality for Undergraduates in Engineering, Science, and Technology (QUEST) is the tuition fee",
            "waiver (presently Rs 1 lakh per semester) for the entire programme under JEE Advanced Rank",
            "Based Fee Waiver provided for UG students. For details, please visit institute website",
            "33"
        ]
    },
    {
        "section": "Scholarships for PG and PhD Students",
        "content": [
            "Eligibility Criteria:",
            "The student receiving the waiver has to maintain a CGPA of 8.0 or above at the end of each",
            "semester  till  they  graduate.  If  any  student  fails  to  maintain  the  required  CGPA,  their  fee",
            "waiver is stopped.",
            "The student shall not engage in any such kind of activity which attracts disciplinary action",
            "towards  them.  If  any  student  is  found  involved  in  any  such  activity,  their  fee  waiver  is",
            "stopped.",
            "The benefit is not resumed in case the fee waiver is stopped due to any reason. Scholarship,",
            "once cancelled, is not revived under any circumstances.",
            "As per the MoE guidelines, the students availing the benefit of one scholarship scheme are",
            "not  eligible  for  availing  the  benefit  of  any  other  scholarship  schemes,  including  state-run",
            "scholarship schemes/ fee waiver & reimbursement schemes.",
            "Post-Graduation Students (PG)",
            "A student enrolled in the MTech programme under the TA category will be provided a monthly",
            "fellowship as per the rules of the Government of India.",
            "The amount of fellowship for the MTech students at present is the following:",
            "MTech  students  enrolled  under  the  TA  category  will  receive  a  monthly  fellowship  of  Rs",
            "12,400 for a maximum duration of 24 months.",
            "MTech  students  enrolled  under  the  RA  category  will  receive  50%  more  scholarship  than",
            "that obtained by the students enrolled under the TA category.",
            "MTech students enrolled under sponsored categories are not entitled to get any fellowship",
            "from the institute.",
            "The  amount  of  fellowship  will  be  updated  from  time  to  time  according  to  the  received",
            "revisions.",
            "Doctor of Philosophy (PhD)",
            "Those  students  who  are  admitted  on  a  full-time  basis  are  considered  for  the  award  of",
            "Teaching/Research Assistantship for a minimum of 6-8 hrs/week with a scholarship as guided",
            "by the Ministry of Education (MoE). The maximum duration for which an assistantship can be",
            "awarded to any PhD student is five years (referred to as HTRA) or till the end of the semester in",
            "which PhD thesis is submitted, whichever is earlier.",
            "Continuation  of  the  assistantship  is  contingent  on  satisfactory  academic  performance  and",
            "satisfactory performance in the discharge of responsibilities (or teaching assistance) assigned",
            "under  the  scheme.  If  performance  in  responsibilities  (or  teaching  assistance)  is  found",
            "unsatisfactory, their scholarship may be stopped at the recommendation of the SRC.",
            "It is to be noted that admission to the programme and the award of assistantship are not",
            "linked.  Admission  to  any  programme  does  not  guarantee  the  award  of  an  assistantship.",
            "Students  whose  assistantship  is  stopped  can  continue  with  the  programme  without",
            "fellowship.",
            "After  submission  of  the  final  PhD  thesis,  the  scholar  will  not  be  provided  with  any  PhD",
            "assistantship.",
            "If a student submits their PhD thesis within four years, they can be given an assistantship",
            "for another period of six months. After five years of enrolment, no assistantship will be given",
            "in any circumstances (with the exception of HTRA for female candidates).",
            "Externally funded PhD students can be given the institute assistantship after the",
            "34"
        ]
    },
    {
        "section": "Travel and Financial Assistance",
        "content": [
            "Continuation  of  the  assistantship  is  contingent  on  satisfactory  academic  performance  and",
            "satisfactory performance in the discharge of responsibilities (or teaching assistance) assigned",
            "under  the  scheme.  If  performance  in  responsibilities  (or  teaching  assistance)  is  found",
            "unsatisfactory, their scholarship may be stopped at the recommendation of the SRC.",
            "It is to be noted that admission to the programme and the award of assistantship are not",
            "linked.  Admission  to  any  programme  does  not  guarantee  the  award  of  an  assistantship.",
            "Students  whose  assistantship  is  stopped  can  continue  with  the  programme  without",
            "fellowship.",
            "After  submission  of  the  final  PhD  thesis,  the  scholar  will  not  be  provided  with  any  PhD",
            "assistantship.",
            "If a student submits their PhD thesis within four years, they can be given an assistantship",
            "for another period of six months. After five years of enrolment, no assistantship will be given",
            "in any circumstances (with the exception of HTRA for female candidates).",
            "Externally  funded  PhD  students  can  be  given  the  institute  assistantship  after  the",
            "exhaustion  of  the  external  funds.  A  minimum  of  18  months  of  support  is  expected  from",
            "external  support  before  switching  to  institutional  support.  The  total  period  of  the",
            "scholarship shall not exceed 5 years (including the external support period).",
            "8.3 Travel Allowance and Contingency Grant",
            "UG,  PG,  and  PhD  students  will  be  given  financial  support  by  the  Institute  for  participating  in",
            "technical, cultural, and sports activities held at other institutes on the recommendation of the",
            "Dean  (Students  Welfare).  This  includes  support  for  participation  in  conferences,  workshops,",
            "internships etc. For detailed policy, please visit the  institute website",
            "8.4 EULER",
            "UG,  PG,  and  PhD  students  without  any  scholarship  may  be  given  subsistence  allowances  for",
            "working  in  the  institute  for  defined  activities  under  this  Earn  While  You  Learn  Scheme.  This",
            "initiative  at",
            "IIT  Jammu  provides  financial  assistance  to  students  through  voluntary",
            "engagement  in  institute-assigned  tasks,  fostering  ownership,  labour  appreciation,  and  self-",
            "confidence.  Participants  gain  practical  experience  in  academic,  administrative,  and  research",
            "roles,  coordinated  by  the  Academics  Section  to  encourage  interdisciplinary  exploration.  For",
            "detailed policy, please visit the  Institute Website.",
            "35"
        ]
    },
    {
        "section": "Awards",
        "content": [
            "9.0",
            "Awards"
        ]
    },
    {
        "section": "UG and PG Awards",
        "content": [
            "9.1 UG Students",
            "President Gold Medal",
            "The  student  with  the  highest  CGPA  among  all  the  graduating  students  of  the  institute  is",
            "accorded  the  President  of  India  Gold  Medal,  provided  the  student  did  not  have  any  backlog",
            "course  in  any  of  the  semesters,  and  there  is  no  record  of  disciplinary  actions  against  the",
            "student. In case, there is more than one graduating student with an identical CGPA up to two",
            "decimal  places,  the  student  who  has  earned  more  credits  will  be  the  awardee  of  the  medal",
            "under consideration. In case, the tie still persists, the following criteria, in descending order of",
            "preference, will be followed to select the awardee:",
            "The student having a BTech degree with a minor will get the first priority.",
            "The student having a BTech degree with honours will get the next level of priority.",
            "A  committee  might  be  constituted  to  break  the  tie  and  select  the  awardee  if  the  tie  still",
            "persists.",
            "Director Gold Medal",
            "The Director Gold Medal is given to the student with the best all-around performance among",
            "all the graduating students of BTech.",
            "Institute Silver Medal",
            "BTech  students  with  the  highest  CGPA  and  graduating  with  honours  among  all  the",
            "graduating students from every major department, excluding the awardee of the President",
            "Gold Medal, will be accorded the Institute Silver Medal.",
            "Prof Ashok K Ahuja Steel Structures Award",
            "This  is  awarded  to  the  graduating  student  of  BTech  with  the  topmost  grade  in  the  course",
            "Design of Steel Structures.",
            "Certificates to Encourage Currently Enrolled Students",
            "To  encourage  currently  enrolled  students,  the  top  three  performers  (based  on  the  SGPA)  of",
            "every batch from every department up to the third year of the degree will receive a certificate",
            "of  encouragement,  provided  the  student  did  not  have  any  backlog  course  in  any  of  the",
            "previous semesters, and there is no record of disciplinary actions against the student.",
            "In  case  of  a  tie-up  CGPA  of  up  to  two  decimal  places,  all  such  students  will  receive  the",
            "certificate.",
            "9.2 PG Students",
            "Institute Gold Medal",
            "This medal is to be awarded to the student who has secured the highest CGPA among all the",
            "graduating students of MTech.",
            "MTech students with the highest CGPA and graduating with honours among all the graduating",
            "students from every major department, excluding the awardee of the Institute Gold Medal, will",
            "be accorded the Institute Silver Medal.",
            "37"
        ]
    },
    {
        "section": "PhD Awards",
        "content": [
            "9.3 PhD Students",
            "Outstanding Doctoral Student Award (PhD)",
            "This shall be awarded every year to one graduating PhD student on the basis of the quality of",
            "the thesis, publications in reputed journals, and other extracurricular achievements.",
            "Disclaimer",
            "The  purpose  of  this  document  is  to  compile  all  relevant  information  in  one  place  as  a",
            "reference  document.  Though  every  effort  is  taken  to  make  this  document  as  accurate  as  is",
            "possible,  in  case  of  any  difference  between  this  document  and  the  curriculum  framework",
            "mentioned in the ordinance, the latter shall prevail.",
            "38"
        ]
    },
    {
        "section": "Annexure A",
        "content": [
            "Annexure A"
        ]
    },
    {
        "section": "credit structure btech civil engineering",
        "content": [
            "Bachelor of Technology in Civil Engineering",
            "Department of Civil Engineering",
            "Overall Credit Structure",
            "S No",
            "Course Category",
            "Minimum Credits",
            "Requirement",
            "1.",
            "2.",
            "3.",
            "4.",
            "5.",
            "6.",
            "7.",
            "8.",
            "9.",
            "Co-Curricular Courses",
            "HSS Core",
            "Science Core",
            "Engineering Core",
            "Design Core",
            "Departmental Core",
            "Departmental Elective",
            "Open Elective",
            "BTech Project",
            "Total",
            "8",
            "6",
            "18.5",
            "21",
            "9",
            "45",
            "12",
            "18",
            "146.5",
            "The list of semester-wise core courses and BTP is tabulated below. The OE and DE shall be",
            "registered from the offered courses from the fifth semester onwards.",
            "Semester I",
            "S No Course Code",
            "Course Name",
            "Lectures Tutorial Practical Credits",
            "Remarks",
            "HS-1-05(TO)",
            "Basic English",
            "HS-1-06(TO)",
            "Advanced English",
            "PH-1-04(TO)",
            "Quantum Mechanics &",
            "Waves and Oscillations",
            "PH-1-02(PO)"
        ]
    },
    {
        "section": "semester 2 course curriculum",
        "content": [
            "*One out of two shall be registered based on a test by the department. A student shall be",
            "required to complete one of these two courses.",
            "Semester II",
            "S No",
            "Course",
            "Code",
            "Course Name",
            "Lectures Tutorial Practical Credits",
            "Remarks",
            "1. CY-1-02(PO)  Chemistry Laboratory",
            "2. CY-1-01(TO)",
            "3. MA-1-02(TO)",
            "4. CS-1-02(MO)",
            "Introduction to",
            "Fundamental and",
            "Applied Chemistry-II",
            "Linear Algebra and",
            "Differential Equations",
            "Data Structure and",
            "Algorithms",
            "5. CE-1-01(TO)",
            "Solid Mechanics",
            "6. CE-1-02(PO)",
            "CAD",
            "7. CE-3-03(TO)",
            "Surveying Theory and",
            "Practices",
            "0",
            "3",
            "2",
            "1",
            "4",
            "1.5",
            "Science Core",
            "Engineering",
            "Core",
            "Design core",
            "Departmental",
            "Semester III",
            "1.",
            "BB-2-01(MO)",
            "Introductory Biology",
            "2.",
            "EE-1-01(TO)",
            "Basic Electrical and",
            "Electronics Engineering",
            "3. ME-1-02(TO)",
            "Fluid Mechanics",
            "4. MT-1-01(TO)",
            "Fundamentals of"
        ]
    },
    {
        "section": "semester 4 course curriculum",
        "content": [
            "Semester IV",
            "S No Course Code",
            "Course Name",
            "Lectures Tutorial Practical Credits",
            "Remarks",
            "1.",
            "HS-2-04(TO)",
            "Introduction to",
            "Economics",
            "2. CE-2-23(PO)",
            "Mini Project",
            "3. CE-2-06(TO)",
            "Building Materials and",
            "Concrete Technology",
            "4. CE-2-07(TO)",
            "Open Channel",
            "Hydraulics",
            "5. CE-2-08(TO)   Structural Analysis-II",
            "6. CE-2-05(MO)",
            "Soil Mechanics",
            "3",
            "0",
            "2",
            "1",
            "HSS Core*",
            "1.5",
            "Design core",
            "Departmental",
            "Core",
            "Semester V",
            "1. CE-2-10(TO)   Design of RC structures",
            "2. CE-2-09(MO)",
            "Transportation",
            "Engineering-I",
            "3. CE-3-04(MO)",
            "Hydrology and Irrigation",
            "Engineering",
            "4.",
            "CE-3-12(TO)",
            "Geotechnical",
            "42"
        ]
    },
    {
        "section": "semester 6 course curriculum",
        "content": [
            "Semester VI",
            "S No Course Code",
            "Course Name",
            "Lectures Tutorial Practical Credits",
            "Remarks",
            "1.",
            "CE-3-13(TO)",
            "2. CE-3-14(MO)",
            "3. CE-3-15(TO)",
            "Transportation",
            "Engineering-II",
            "Water Supply and",
            "Wastewater",
            "Engineering",
            "Design of Steel",
            "Structures",
            "3",
            "2",
            "0",
            "Departmental",
            "Core",
            "Semester VII",
            "CE-4-16(TO)",
            "2.",
            "CE-4-17(TO)",
            "Construction",
            "Management and",
            "Practices",
            "Air Pollution and",
            "Solid Waste",
            "Management",
            "3.",
            "BTP I",
            "6",
            "BTP",
            "Semester VIII",
            "BTP II",
            "2. CE-4-16(TO)",
            "12",
            "43"
        ]
    },
    {
        "section": "course curriculum semester 1",
        "content": [
            "Bachelor of Technology in Chemical Engineering",
            "Department of Chemical Engineering",
            "Overall Credit Structure",
            "S No",
            "Course Category",
            "Minimum Credits",
            "Requirement",
            "1.",
            "2.",
            "3.",
            "4.",
            "5.",
            "6.",
            "7.",
            "8.",
            "9.",
            "Co-Curricular Courses",
            "HSS Core",
            "Science Core",
            "Engineering Core",
            "Design Core",
            "Departmental Core",
            "Departmental Elective",
            "Open Elective",
            "BTech Project",
            "Total",
            "8",
            "6",
            "18.5",
            "21",
            "8.5",
            "45",
            "12",
            "18",
            "9",
            "146",
            "The list of semester-wise core courses and BTP is tabulated below. The OE and DE shall be",
            "registered from the offered courses from the fifth semester onwards.",
            "Semester I",
            "S No Course Code",
            "Course Name",
            "Lectures Tutorial Practical Credits",
            "Remarks",
            "HS-1-05(TO)",
            "Basic English",
            "HS-1-06(TO)",
            "Advanced English",
            "PH-1-04(TO)",
            "Quantum Mechanics &",
            "Waves and Oscillations"
        ]
    },
    {
        "section": "semester 2 course curriculum",
        "content": [
            "*One out of two shall be registered based on a test by the department. A student shall be",
            "required to complete one of these two courses.",
            "Semester II",
            "S No Course Code",
            "Course Name",
            "Lectures Tutorial Practical Credits",
            "Remarks",
            "1. CY-1-02(PO)  Chemistry Laboratory",
            "2.",
            "CY-1-01(TO)",
            "3. MA-1-02(TO)",
            "4. CS-1-02(MO)",
            "5.",
            "CE-1-01(TO)",
            "Introduction to",
            "Fundamental and",
            "Applied Chemistry-II",
            "Linear Algebra and",
            "Differential",
            "Equations",
            "Data Structure and",
            "Algorithms",
            "Engineering",
            "Thermodynamics",
            "6. ME-1-03(PO)",
            "Workshop",
            "7. CH-1-03(TO)",
            "Chemical and",
            "Process Engineering",
            "Calculations",
            "0",
            "3",
            "2",
            "1",
            "Semester III",
            "4",
            "1.5",
            "Science Core",
            "Core",
            "Design core",
            "Departmental",
            "1.",
            "ME-1-01(TO)  Engineering Mechanics",
            "HS-2-04(TO)",
            "Economics",
            "3.",
            "EE-1-01(TO)",
            "Basic Electrical and",
            "Electronics Engineering",
            "4. CH-2-16(MO)   Numerical Methods"
        ]
    },
    {
        "section": "semester 4 course curriculum ",
        "content": [
            "Semester IV",
            "S No Course Code",
            "Course Name",
            "Lectures Tutorial Practical Credits",
            "Remarks",
            "1.",
            "CE-1-01(TO)",
            "Solid Mechanics",
            "2. CH-2-18(PO)",
            "Mini Project",
            "3.",
            "BB-2-01(MO)",
            "Introductory Biology",
            "4. CH-2-06(TO) Fluid Flow Operations",
            "5. CH-2-07(TO)",
            "Heat Transfer",
            "Operations",
            "6. CH-2-08(TO)",
            "Mass Transfer-I",
            "3",
            "0",
            "2",
            "Engineering",
            "Core",
            "1.5",
            "Design Core",
            "3.5",
            "Science",
            "Departmental",
            "Semester V",
            "S No",
            "Course",
            "Code",
            "2.",
            "Fluid Flow",
            "Operations  00a0Lab",
            "Heat Transfer and",
            "Thermodynamics Lab",
            "3.CH-3-11(TO)",
            "Mass Transfer-II",
            "4.",
            "CH-3-",
            "09(TO)",
            "Chemical Reaction",
            "Engineering-I",
            "5.CH-3-10(TO)",
            "6.",
            "Mechanical",
            "BTP I",
            "6"
        ]
    },
    {
        "section": "semester 7 course curriculum",
        "content": [
            "Semester VI",
            "Course Name",
            "LectureTutorialPracticalCredits",
            "Remarks",
            "S No",
            "Course",
            "Code",
            "1.CH-3-13(TO)",
            "Process",
            "Instrumentation,",
            "Dynamics and",
            "Controls",
            "2.",
            "Mass Transfer Lab",
            "3.CH-3-12(TO)",
            "4.",
            "5",
            "Chemical Reaction",
            "Engineering-II",
            "Mechanical Operation",
            "Lab",
            "BTP II",
            "3",
            "0",
            "1",
            "6",
            "Departmental",
            "Core",
            "BTP",
            "Semester VII",
            "S No Course Code",
            "1.CH-4-15(TO)",
            "3.",
            "5.",
            "Product Process and",
            "Plant Design",
            "Process Modeling and",
            "Simulation Lab",
            "Controls Lab",
            "Engineering Lab",
            "BTP III",
            "1.5",
            "Semester VIII OE and DE only",
            "47"
        ]
    },
    {
        "section": "Page 48",
        "content": [
            "Bachelor of Technology in Computer Science and Engineering",
            "Department of Computer Science and Engineering",
            "Overall Credit Structure",
            "S No",
            "Course Category",
            "Minimum Credits",
            "Requirement",
            "1.",
            "2.",
            "3.",
            "4.",
            "5.",
            "6.",
            "7.",
            "8.",
            "9.",
            "Co-Curricular Courses",
            "HSS Core",
            "Science Core",
            "Engineering Core",
            "Design Core",
            "Departmental Core",
            "Departmental Elective",
            "Open Elective",
            "BTech Project",
            "Total",
            "8",
            "6",
            "18.5",
            "21",
            "9",
            "41",
            "16",
            "18",
            "146.5",
            "The list of semester-wise core courses and BTP is tabulated below. The OE and DE shall be",
            "registered from the offered courses from the fifth semester onwards.",
            "Semester I",
            "S",
            "No",
            "Course Code",
            "Course Name",
            "LectureTutorialPracticalCredits",
            "Remarks",
            "1.HS-1-05(TO)",
            "Basic English",
            "2.HS-1-06(TO)",
            "Advanced English",
            "3.CY-1-02(PO)Chemistry Laboratory",
            "4.CY-1-01(TO)"
        ]
    },
    {
        "section": "Page 49",
        "content": [
            "*One out of two shall be registered based on a test by the department. A student shall be",
            "required to complete one of these two courses.",
            "Semester II",
            "S No Course Code",
            "Course Name",
            "LectureTutorialPracticalCredits",
            "Remarks",
            "1.",
            "PH-1-03(TO)",
            "Quantum Mechanics",
            "& Electromagnetic",
            "Theory",
            "2.",
            "PH-1-02(PO)",
            "Physics Laboratory",
            "3.MA-1-02(TO)",
            "4.CS-1-02(MO)",
            "Linear Algebra and",
            "Differential Equations",
            "Data Structure and",
            "Algorithms",
            "5.ME-1-03(PO)",
            "Workshop",
            "6.CS-2-03(TO)",
            "Discrete Mathematical",
            "Structure-I",
            "7.",
            "EE-1-03(TO)",
            "Electronics System",
            "3",
            "0",
            "2",
            "1",
            "Semester III",
            "4",
            "Science Core",
            "1.5",
            "Engineering",
            "Core",
            "Design core",
            "Departmental",
            "BB-2-01(MO)",
            "Introductory Biology",
            "ME-1-01(TO)",
            "MT-1-01(TO)",
            "Mechanics",
            "Fundamentals of",
            "Materials",
            "CH-2-16(MO) Numerical Methods",
            "5."
        ]
    },
    {
        "section": "Page 50",
        "content": [
            "Semester IV",
            "S No",
            "Course",
            "Code",
            "Course Name",
            "LectureTutorialPracticalCredits",
            "Remarks",
            "1",
            "CE-1-01(TO)",
            "Solid Mechanics",
            "2",
            "CS-2-14(PO)",
            "Mini Project",
            "3",
            "CS-2-",
            "07(MO)",
            "4CS-2-05(TO)",
            "Principles of",
            "Programming",
            "Languages",
            "Discrete",
            "Mathematical",
            "Structure-II",
            "5.",
            "06(MO)",
            "Design and Analysis",
            "of Algorithms",
            "6",
            "HS-2-04(TO)",
            "Introduction to",
            "Economics",
            "0",
            "Semester V",
            "Engineering",
            "Core",
            "1.5",
            "Design Core",
            "4",
            "Departmental",
            "HSS Core",
            "S No Course Code",
            "Lectures Tutorial Practical Credits",
            "CS-3-",
            "09(MO)",
            "08(MO)",
            "CS-3-11(TO)",
            "Database",
            "Management",
            "Systems",
            "Operating Systems"
        ]
    },
    {
        "section": "Page 51",
        "content": [
            "Semester VII",
            "S No Course Code",
            "Course Name",
            "Lectures Tutorial Practical Credits",
            "Remarks",
            "1CS-4-13(MO)",
            "Software Engineering",
            "and Design Paradigm",
            "2",
            "BTP II",
            "3",
            "0",
            "12",
            "4",
            "6",
            "Departmental",
            "Core",
            "BTP",
            "Semester VIII 2013OE and DE only",
            "51"
        ]
    },
    {
        "section": "Page 52",
        "content": [
            "Bachelor of Technology in Electrical Engineering",
            "Department of Electrical Engineering",
            "Overall Credit Structure",
            "S No",
            "Course Category",
            "Minimum Credits",
            "Requirement",
            "1.",
            "2.",
            "3.",
            "4.",
            "5.",
            "6.",
            "7.",
            "8.",
            "9.",
            "Co-Curricular Courses",
            "HSS Core",
            "Science Core",
            "Engineering Core",
            "Design Core",
            "Departmental Core",
            "Departmental Elective",
            "Open Elective",
            "BTech Project",
            "Total",
            "8",
            "6",
            "18.5",
            "21",
            "8.5",
            "45",
            "12",
            "18",
            "9",
            "146",
            "The list of semester-wise core courses and BTP is tabulated below. The OE and DE shall be",
            "registered from the offered courses from the fifth semester onwards.",
            "Semester I",
            "Course",
            "Code",
            "Course Name",
            "LectureTutorialPracticalCredits",
            "Remarks",
            "HS-1-05(TO)",
            "Basic English",
            "HS-1-06(TO)",
            "Advanced English",
            "3.CY-1-02(PO)Chemistry Laboratory",
            "4.CY-1-01(TO)"
        ]
    },
    {
        "section": "Page 53",
        "content": [
            "*One out of two shall be registered based on a test by the department. A student shall be",
            "required to complete one of these two courses.",
            "Semester II",
            "S No Course Code",
            "Course Name",
            "LectureTutorialPracticalCredits",
            "Remarks",
            "1",
            "PH-1-03(TO)",
            "Quantum Mechanics",
            "& Electromagnetic",
            "Theory",
            "2",
            "PH-1-02(PO)",
            "Physics Laboratory",
            "3MA-1-02(TO)",
            "4CS-1-02(MO)",
            "Linear Algebra and",
            "Differential",
            "Equations",
            "Data Structure and",
            "Algorithms",
            "5.ME-1-03(PO)",
            "Workshop",
            "6.",
            "EE-1-03(TO)",
            "Electronics System",
            "7.",
            "EE-1-04(TO)",
            "Network Analysis and",
            "Synthesis",
            "3",
            "0",
            "Semester III",
            "4",
            "Science Core",
            "1.5",
            "Engineering",
            "Core",
            "Design core",
            "Departmental",
            "core",
            "BB-2-01(MO)",
            "Introductory Biology",
            "2ME-1-01(TO)",
            "EE-1-02(PO)",
            "EE-2-06(TO)",
            "Mechanics",
            "Electrical and",
            "Electronics Design"
        ]
    },
    {
        "section": "Page 54",
        "content": [
            "Semester IV",
            "S No",
            "Course",
            "Code",
            "Course Name",
            "Lecture",
            "TutorialPracticalCredits",
            "Remarks",
            "1. 00a0CE-1-01(TO) Solid Mechanics",
            "2.EE-2-21(PO)",
            "Mini Project",
            "3.CH-1-01(TO)",
            "4.MT-1-02(TO)",
            "5.",
            "EE-2-",
            "09(MO)",
            "6.",
            "EE-2-10(TO)",
            "Engineering",
            "Thermodynamics",
            "Standards",
            "RF Circuits and",
            "Antennas",
            "Communication",
            "Systems",
            "3",
            "0",
            "1",
            "Core",
            "1.5",
            "Design Core",
            "0.0",
            "2",
            "Departmental",
            "core",
            "Semester V",
            "S",
            "No",
            "Course Code",
            "Lectures Tutorial",
            "Practical Credits",
            "1.",
            "EE-3-11(MO) Electrical Machine",
            "2.EE-3-12(TO) Power Electronics",
            "3.EE-3-13(TO)",
            "4.EE-3-14(MO)",
            "Physical",
            "Electronics",
            "Digital",
            "5.EE-3-15(MO) Control System"
        ]
    },
    {
        "section": "semester 6 btech course curriculum",
        "content": [
            "Semester VI",
            "S No",
            "Course",
            "Code",
            "Course Name",
            "Lectures Tutorial",
            "Practical Credits",
            "Remarks",
            "1.",
            "EE-3-16(TO)",
            "2.",
            "3. EE-3-18(MO)",
            "Digital Signal",
            "Processing",
            "Power",
            "Engineering",
            "Analog",
            "Electronics",
            "2",
            "3",
            "1",
            "0",
            "4",
            "Departmental",
            "Core",
            "Semester VII",
            "S No Course Code Course Name Lectures",
            "Tutorial",
            "BTP I",
            "6",
            "BTP",
            "Semester VIII",
            "S No Course Code Course Name",
            "Lectures",
            "BTP II",
            "BTP III",
            "55"
        ]
    },
    {
        "section": "credit structure material engineering ug",
        "content": [
            "Bachelor of Technology in Materials Engineering",
            "Department of Materials Engineering",
            "Overall Credit Structure",
            "S No",
            "Course Category",
            "Minimum Credits",
            "Requirement",
            "1.",
            "2.",
            "3.",
            "4.",
            "5.",
            "6.",
            "7.",
            "8.",
            "9.",
            "Co-Curricular Courses",
            "HSS Core",
            "Science Core",
            "Engineering Core",
            "Design Core",
            "Departmental Core",
            "Departmental Elective",
            "Open Elective",
            "BTech Project",
            "Total",
            "8",
            "6",
            "18.5",
            "21",
            "9",
            "41.5",
            "15",
            "18",
            "146",
            "The list of semester-wise core courses and BTP is tabulated below. The OE and DE shall be",
            "registered from the offered courses from the fifth semester onwards.",
            "Semester I",
            "S No Course Code Course Name",
            "Lecture Tutorial Practical Credits",
            "Remarks",
            "HS-1-05(TO)",
            "Basic English",
            "HS-1-06(TO)",
            "Advanced",
            "English",
            "MA-1-01(TO)",
            "Calculus",
            "CY-1-01(TO)",
            "CY-1-02(PO)"
        ]
    },
    {
        "section": "semester 2 btech course curriculum",
        "content": [
            "*One out of two shall be registered based on a test by the department. A student shall be",
            "required to complete one of these two courses.",
            "Semester II",
            "S No Course Code Course Name",
            "Lecture",
            "Tutorial Practical Credits",
            "Remarks",
            "1.MA-1-02(TO)",
            "2.",
            "PH-1-04(TO)",
            "Linear Algebra and",
            "Differential",
            "Equations",
            "Quantum",
            "Mechanics & Waves",
            "and Oscillations",
            "3.",
            "PH-1-02(PO) Physics Laboratory",
            "4.CE-1-01(TO)",
            "Solid Mechanics",
            "5.CH-1-01(TO)",
            "6.CS-1-02(MO)",
            "7.ME-1-03(PO)",
            "Engineering",
            "Thermodynamics",
            "Data Structure and",
            "Algorithms",
            "Mechanical",
            "Workshop",
            "3",
            "0",
            "2",
            "1",
            "4",
            "Science Core",
            "1.5",
            "Core",
            "Design core",
            "Semester III",
            "S No",
            "Course",
            "Code",
            "Course Name",
            "Lecture Tutorial Practical Credits",
            "1.HS-2-04(TO)",
            "Introduction to",
            "Economics",
            "2.MT-1-01(TO)",
            "EE-1-01(TO)",
            "Fundamentals of"
        ]
    },
    {
        "section": "semester 4 btech course curriculum",
        "content": [
            "Semester IV",
            "S No",
            "Course",
            "Code",
            "Course Name",
            "Lecture Tutorial Practical Credits",
            "Remarks",
            "1.",
            "BB-2-01(MO)",
            "Introductory Biology",
            "2",
            "2.MT-1-02(TO)",
            "3.MT-2-05(TO)",
            "4.MT-2-06(TO)",
            "5.MT-2-09(TO)",
            "6.MT-2-10(TO)",
            "Graduation",
            "Requirement",
            "Engineering",
            "Standards",
            "Characterization of",
            "Materials",
            "Phase Transformations",
            "in Materials",
            "Fundamentals of Metal",
            "Extraction",
            "Characterization Lab",
            "16 credits",
            "1.5",
            "3",
            "0",
            "1",
            "4",
            "3.5",
            "Science Core",
            "Design Core",
            "Departmental",
            "Core",
            "Semester V",
            "S No Course Code",
            "Lectures Tutorial Practical Credits",
            "1.MT-3-14(TO)",
            "Mechanical Behaviour",
            "of Materials",
            "2.MT-3-13(TO)",
            "Polymer Physics",
            "3.MT-3-11(TO)",
            "4.",
            "5.",
            "Ceramics"
        ]
    },
    {
        "section": "semester 6 btech course curriculum",
        "content": [
            "Semester VI",
            "S No Course Code",
            "Course Name",
            "Lectures Tutorial Practical Credits",
            "Remarks",
            "1.MT-3-12(TO)",
            "2.",
            "3.",
            "Industrial Materials",
            "Processing",
            "Surface Degradation",
            "of Materials",
            "Material Processing",
            "Lab",
            "3",
            "0",
            "4",
            "2",
            "Departmental",
            "Core",
            "Semester VII",
            "S No",
            "Course",
            "Code",
            "1.",
            "Lectures",
            "Tutorial",
            "Practical Credits",
            "ICME",
            "Advance material",
            "BTP I",
            "6",
            "BTP",
            "Semester VIII",
            "BTP II",
            "BTP III",
            "59"
        ]
    },
    {
        "section": "Mathematics and computing course structure",
        "content": [
            "Bachelor of Technology in Mathematics and Computing",
            "Department of Mathematics",
            "Overall Credit Structure",
            "S No",
            "Course Category",
            "Minimum Credits",
            "Requirement",
            "1.",
            "2.",
            "3.",
            "4.",
            "5.",
            "6.",
            "7.",
            "8.",
            "9.",
            "Co-Curricular Courses",
            "HSS Core",
            "Science Core",
            "Engineering Core",
            "Design Core",
            "Departmental Core",
            "Departmental Elective",
            "Open Elective",
            "BTech Project",
            "Total",
            "8",
            "6",
            "18.5",
            "21",
            "9",
            "41",
            "16",
            "18",
            "146.5",
            "The List of semester-wise core courses and BTP is tabulated below. The OE and DE shall be",
            "registered from the offered courses from the fifth semester onwards",
            "Semester I",
            "S No Course Code",
            "Course Name",
            "Lecture Tutorial Practical Credits",
            "Remarks",
            "HS-1-05(TO)",
            "Basic English",
            "HS-1-06(TO)",
            "Advanced English",
            "CY-1-02(PO) Chemistry Laboratory",
            "CY-1-01(TO)",
            "Introduction to",
            "Fundamental and"
        ]
    },
    {
        "section": "semester 2 course structure",
        "content": [
            "*One out of two shall be registered based on a test by the department. A student shall be",
            "required to complete one of these two courses.",
            "Semester II",
            "S No Course Code",
            "Course Name",
            "Lecture  Tutorial Practical Credits",
            "Remarks",
            "1.",
            "PH-1-03(TO)",
            "Quantum Mechanics &",
            "Electromagnetic",
            "Theory",
            "2.",
            "PH-1-02(PO)",
            "Physics Laboratory",
            "3. MA-1-02(TO)",
            "4  CS-1-02(MO)",
            "Linear Algebra and",
            "Differential Equations",
            "Data Structure and",
            "Algorithms",
            "5.ME-1-03(PO)",
            "Workshop",
            "6.",
            "CH-1-01(TO)",
            "Engineering",
            "Thermodynamics",
            "7.",
            "EE-1-03(TO)",
            "Electronics System",
            "3",
            "0",
            "2",
            "1",
            "4",
            "1.5",
            "Science",
            "Core",
            "Design core",
            "Semester III",
            "Lecture Tutorial Practical",
            "Credits",
            "BB-2-01(MO)",
            "Introductory Biology",
            "ME-1-01(TO)",
            "Mechanics",
            "3.CH-2-16(MO) Numerical Methods",
            "4.",
            "EE-1-02(PO)",
            "5.MA-2-07(TO)"
        ]
    },
    {
        "section": "semester 4 btech course curriculum",
        "content": [
            "Semester IV",
            "S No Course Code",
            "Course Name",
            "Lecture Tutorial Practical Credits",
            "Remarks",
            "1.",
            "CE-1-01(TO)",
            "Solid Mechanics",
            "2.MA-2-05(PO)",
            "Mini Project",
            "3.MA-2-10(TO)",
            "4.MA-2-08(TO)",
            "5.CS-2-06(MO)",
            "6.",
            "HS-2-04(TO)",
            "Probability and",
            "Stochastic Process",
            "Real and Complex",
            "Analysis",
            "Design and Analysis",
            "of Algorithms",
            "Introduction to",
            "Economics",
            "3",
            "0",
            "1",
            "Semester V",
            "2",
            "Engineering",
            "Core",
            "1.5",
            "Design Core",
            "4",
            "Departmental",
            "HSS Core",
            "Lectures Tutorial Practical Credits",
            "1.CS-3-09(MO)",
            "2.CS-3-08(MO)",
            "Database",
            "Management",
            "Systems",
            "Operating",
            "3.MA-3-06(TO)",
            "Basic Algebra",
            "4.",
            "Statistical",
            "Methods",
            "Semester VI",
            "Linear Algebra and",
            "Applications"
        ]
    },
    {
        "section": "semester 7 course curriculum btech",
        "content": [
            "Semester VII",
            "S No",
            "Course",
            "Code",
            "Course Name",
            "Lectures",
            "Tutorial Practical Credits",
            "Remarks",
            "MA-4-",
            "09(TO)",
            "1.",
            "2.",
            "Optimization",
            "Methods and",
            "Applications",
            "BTP I",
            "3",
            "0",
            "1",
            "6",
            "Departmental",
            "Core",
            "BTP",
            "Semester VIII",
            "BTP II",
            "BTP III",
            "63"
        ]
    },
    {
        "section": "credit structure mechanical engineering btech",
        "content": [
            "Bachelor of Technology in Mechanical Engineering",
            "Department of Mechanical Engineering",
            "Overall Credit Structure",
            "S No",
            "Course Category",
            "Minimum Credits",
            "Requirement",
            "1.",
            "2.",
            "3.",
            "4.",
            "5.",
            "6.",
            "7.",
            "8.",
            "9.",
            "Co-Curricular Courses",
            "HSS Core",
            "Science Core",
            "Engineering Core",
            "Design Core",
            "Departmental Core",
            "Departmental Elective",
            "Open Elective",
            "BTech Project",
            "Total",
            "8",
            "6",
            "18.5",
            "24",
            "10.5",
            "40.5",
            "12",
            "18",
            "9",
            "146.5",
            "The list of semester-wise core courses and BTP is tabulated below. The OE and DE shall be",
            "registered from the offered courses from the fifth semester onwards.",
            "Semester I",
            "S No Course Code",
            "Course Name",
            "LectureTutorialPracticalCredits",
            "Remarks",
            "HS-1-05(TO)",
            "Basic English",
            "HS-1-06(TO)",
            "Advanced English",
            "3.MA-1-01(TO)",
            "Calculus",
            "PH-1-04(TO)"
        ]
    },
    {
        "section": "semester 2 btech course curriculum",
        "content": [
            "*One out of two shall be registered based on a test by the department. A student shall be",
            "required to complete one of these two courses.",
            "Semester II",
            "S No Course Code",
            "Course Name",
            "Lecture Tutorial Practical Credits",
            "Remarks",
            "1.",
            "MA-1-02(TO)",
            "2.",
            "CY-1-03(TO)",
            "Linear Algebra and",
            "Differential Equations",
            "Introduction to",
            "Fundamental and",
            "Applied Chemistry-II",
            "3.",
            "CY-1-02(PO)",
            "Chemistry Laboratory",
            "4.",
            "CS-1-02(MO)",
            "Data Structure and",
            "Algorithms",
            "5.",
            "CE-1-01(TO)",
            "Solid Mechanics",
            "6.",
            "CH-1-01(TO)",
            "Engineering",
            "Thermodynamics",
            "7.",
            "ME-1-03(PO) Mechanical Workshop",
            "3",
            "0",
            "2",
            "1",
            "4",
            "Science Core",
            "1.5",
            "Core",
            "Design Core",
            "Semester III",
            "HS-2-04(TO)",
            "Economics",
            "EE-1-01(TO)",
            "MT-1-01(TO)",
            "4.ME-2-04(TO)",
            "Basic Electrical and",
            "Electronics Engineering",
            "Fundamentals of"
        ]
    },
    {
        "section": "semester 4 btech curriculum",
        "content": [
            "Semester IV",
            "S No",
            "Course",
            "Code",
            "Course Name",
            "Lecture",
            "Tutorial Practical Credits",
            "Remarks",
            "1.",
            "BB-2-01(MO)",
            "Introductory Biology",
            "2.ME-2-20(PO)",
            "Mini Project",
            "2",
            "0",
            "3.MT-1-02(TO)  Engineering Standards",
            "1.5",
            "4.",
            "Manufacturing Processes",
            "Lab-I",
            "5.ME-2-14(PO)",
            "Fluid Mechanics Lab",
            "6.ME-2-16(TO)",
            "Manufacturing",
            "Processes-II",
            "7.ME-3-17(TO)",
            "Kinematics and Dynamics",
            "of Machines",
            "8.ME-2-12(TO)",
            "Heat Transfer",
            "3",
            "1",
            "3.5",
            "Science Core",
            "Design Core",
            "Departmental",
            "Core",
            "Semester V",
            "Lectures",
            "Tutorial",
            "Practical Credits",
            "Vibration",
            "Kinematics and",
            "Dynamics of Machines",
            "Lab",
            "Manufacturing System",
            "Design",
            "Thermal Energy System",
            "Machine Design",
            "Processes Lab-II"
        ]
    },
    {
        "section": "semester 6 btech curriculum",
        "content": [
            "Semester VI",
            "S No Course Code",
            "Course Name",
            "Lectures",
            "Tutorial",
            "Practical Credits",
            "Remarks",
            "1.",
            "Mech Design Lab-I",
            "2.ME-3-09(PO)",
            "Mechanical Engineering",
            "Drawing",
            "3.",
            "ME-3-18(TO)",
            "Control Engineering",
            "4.",
            "Control Engineering Lab",
            "5.ME-3-06(TO)",
            "Introduction to",
            "Operations Research",
            "6.",
            "BTP I",
            "0",
            "3",
            "1",
            "2",
            "6",
            "1.5",
            "Departmental",
            "Core",
            "BTP",
            "Semester VII",
            "S No Course Code Course Name Lectures",
            "Practical",
            "Credits",
            "BTP II",
            "Semester VIII",
            "S No Course Code Course Name",
            "BTP III",
            "67"
        ]
    },
    {
        "section": "location",
        "content": [
            "Indian Institute of Technology Jammu",
            "Jagti, NH-44, PO Nagrota,",
            "Jammu-181 221, J&K, India",
            "Acknowledgements",
            "Sameer Kumar Pachalla",
            "Shanmugadas KP",
            "Mir Faizan Ul Haq",
            "July 2024"
        ]
    }
]